Merge pull request #10 from phin3has/workflow-clean-ups-aisle-5
feat: cleaned up README
